app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.characters.any? %>
---
SELECT  1 AS one FROM "characters" WHERE "characters"."user_id" = $1 LIMIT 1  [["user_id", 1]]