app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = $1  [["user_id", 1]]
---
<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.characters.count, "character") %></span>