app/controllers/characters_controller.rb

  def create
    @character = current_user.characters.build(character_params)
    if @character.save
---
INSERT INTO "characters" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Spooky"], ["description", "Gun Adept"], ["user_id", 1], ["created_at", "2016-04-15 20:23:19.742913"], ["updated_at", "2016-04-15 20:23:19.742913"]]

  def edit
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1  ORDER BY "characters"."created_at" DESC LIMIT 1  [["id", 3]]

  def destroy
    @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 2]]

  def update
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1  ORDER BY "characters"."created_at" DESC LIMIT 1  [["id", 3]]