app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @character = current_user.characters.build
      @character_feed_items = current_user.character_feed.paginate(page: params[:page])
---
SELECT  "characters".* FROM "characters" WHERE (user_id = 1)  ORDER BY "characters"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = $1  [["user_id", 1]]