app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "characters".* FROM "characters" WHERE "characters"."user_id" = $1  ORDER BY "characters"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @characters = @user.characters.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "slack_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save